"use strict";

console.log("1. Вёрстка валидная +10\n");

console.log("2. Вёрстка семантическая +20");
console.log("\t· В коде странице присутствуют следующие элементы (указано минимальное количество, может быть больше):");
console.log("\t· <header>, <main>, <footer> +3");
console.log("\t· четыре элемента <section> (по количеству секций) +3")
console.log("\t· только один заголовок <h1> +3");
console.log("\t· три заголовка <h2> (количество секций минус одна, у которой заголовок <h1>) +3");
console.log("\t· один элемент <nav> (панель навигации) +3");
console.log("\t· два списка ul > li > a (панель навигации, ссылки на соцсети) +3\n");
console.log("\t· четыре кнопки <button> +2\n");

console.log("3. Вёрстка соответствует макету +48");
console.log("\t· блок <header> +6");
console.log("\t· секция preview +9");
console.log("\t· секция steps +9");
console.log("\t· секция destinations +9");
console.log("\t· секция stories +9");
console.log("\t· блок <footer> +6\n");

console.log("4. Требования к css + 12");
console.log("\t· для построения сетки используются флексы или гриды +2");
console.log("\t· при уменьшении масштаба страницы браузера вёрстка размещается по центру, а не сдвигается в сторону +2");
console.log("\t· фоновый цвет тянется на всю ширину страницы +2");
console.log("\t· иконки добавлены в формате .svg. SVG может быть добавлен любым способом. Обращаем внимание на формат, а не на способ добавления +2");
console.log("\t· изображения добавлены в формате .jpg +2");
console.log("\t· есть favicon +2\n");

console.log("5. Интерактивность, реализуемая через css +20");
console.log("\t· плавная прокрутка по якорям +5");
console.log("\t· иконки соцсетей в футере при нажатии на них ведут на гитхаб автора проекта и на страницу курса (допускается добавление своих вариантов иконок github или RSSchool) https://rs.school/js-stage0/ +5");
console.log("\t· интерактивность включает в себя не только изменение внешнего вида курсора, например, при помощи свойства cursor: pointer, но и другие визуальные эффекты, например, изменение цвета фона или цвета шрифта. Если в макете указаны стили при наведении и клике, для элемента указываем эти стили. Если в макете стили не указаны, реализуете их по своему усмотрению, руководствуясь общим стилем макета +5");
console.log("\t· обязательное требование к интерактивности: плавное изменение внешнего вида элемента при наведении и клике не влияющее на соседние элементы +5");

